#!/bin/bash

# Збереження шляху до директорії configs
SOURCE_DIR="./configs"

# Перевірка, чи директорія configs існує
if [ ! -d "$SOURCE_DIR" ]; then
    echo "Директорія 'configs' не існує в поточному розташуванні."
    exit 1
fi

# Перенесення файлів до домашньої директорії
cp -r "$SOURCE_DIR"/. ~/

# Перевірка, чи команда виконалась успішно
if [ $? -eq 0 ]; then
    echo "Файли успішно перенесено до домашньої директорії."
else
    echo "Виникла помилка при перенесенні файлів."
    echo "Спробуйте самостійно перенести файли:"
    echo "sudo cp -r configs/. ~/"
    exit 1
fi

